Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination.analysisObject
The analysis object.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination.numberOfGroupIds
The number of identifiers of the groups of the analysis load combination.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination.groupIds
The identifier of the groups of the analysis load combination.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination.name
The name of the analysis load combination.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination.type
The type of the analysis load combination.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination.numberOfScalingFactors
The number of scaling factors of the analysis load combination.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination.scalingFactors
The scaling factors of the analysis load combination.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination.numberOfReductionFactors
The number of reduction factors of the analysis load combination.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination.reductionFactors
The reduction factors of the analysis load combination.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination.numberOfPartialSafetyFactors
The number of partial safety factors of the analysis load combination.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination.partialSafetyFactors
The partial safety factors of the analysis load combination.